app/controllers/api/v1/cities_controller.rb

  def index
    respond_with City.all
---
SELECT "cities".* FROM "cities"

  def create
    respond_with :api, :v1, City.create(item_params)
---
INSERT INTO "cities" ("created_at", "updated_at", "name", "description") VALUES (?, ?, ?, ?)  [["created_at", "2017-09-15 21:44:28.144580"], ["updated_at", "2017-09-15 21:44:28.144580"], ["name", "Fortaleza"], ["description", "teste"]]